---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.IndexStreamPoint
source: html/73e0461f-64b6-eb5c-b2bd-49611adc836f.htm
---
# IndexStreamPoint Properties

Specifies whether the .NET object represents a valid Revit entity.